<center><h1 style="color:Purple">איך פגשתי את אמא</h1></center> <br />
<img src="images/pic.jpg" alt="how i met your mother" height="300px" width="550px" />
<br /><br />

איך פגשתי את אמא (How I Met Your Mother) היא קומדיית מצבים אמריקאית זוכת פרס אמי של רשת CBS, המגוללת את סיפורו של טד במציאת אהבת האמת שלו בניו יורק.
הסדרה, שנחשבת לאחת מסדרות הטלוויזיה הפופולריות ביותר כיום, החלה את דרכה בשנת 2005 ובימים אלו משודרת העונה השישית.
בישראל הסדרה שודרה מתחילתה בערוץ Yes stars 1 (כיום Yes stars Comedy) במסגרת שידורי yes, אשר רכשה את כל עונותיה. התוכנית שודרה גם בערוץ סטאר וורלד עד ששידורי הערוץ הסתיימו בישראל, ב-4 בינואר 2009.
הסדרה נוצרה על ידי קרייג תומאס וקרטר בייס שכתבו יחד את הפיילוט לסדרה שזכה להצלחה מיידית.
במהלך שש העונות של התוכנית, הייתה הסדרה והשחקנים מועמדים לפרסים רבים.


